In [4]:
#CONCATINATE: joining 2 or more dataframes
import pandas as pd
india_weather = pd.DataFrame ({
    'city' : ['mumbai', 'delhi', 'bangalore'],
    'temperature' : [32, 45, 30],
    'humidity' : [80, 60, 78]
})
india_weather

        city  temperature  humidity
0     mumbai           32        80
1      delhi           45        60
2  bangalore           30        78

In [12]:
us_weather = pd.DataFrame ({
    'city' : ['new york', 'chicago', 'orlando'],
    'temperature' : [21, 14, 35],
    'humidity' : [68, 65, 75]
})
us_weather

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

In [17]:
#in concat you need to specify you dataframes u want to join 
df = pd.concat([india_weather, us_weather], ignore_index=True)
df

        city  temperature  humidity
0     mumbai           32        80
1      delhi           45        60
2  bangalore           30        78
3   new york           21        68
4    chicago           14        65
5    orlando           35        75

In [20]:
df = pd.concat([india_weather, us_weather], keys=['india','us'])
df

              city  temperature  humidity
india 0     mumbai           32        80
      1      delhi           45        60
      2  bangalore           30        78
us    0   new york           21        68
      1    chicago           14        65
      2    orlando           35        75

In [21]:
df.loc['india'] #key can be used to locate

        city  temperature  humidity
0     mumbai           32        80
1      delhi           45        60
2  bangalore           30        78

In [28]:
temperature_df = pd.DataFrame({
    "city": ["mumbai","delhi","banglore"],
    "temperature": [32,45,30],
})
temperature_df

       city  temperature
0    mumbai           32
1     delhi           45
2  banglore           30

In [27]:
windspeed_df = pd.DataFrame({
    "city": ["delhi","mumbai"],
    "windspeed": [7,12],
})
windspeed_df

     city  windspeed
0   delhi          7
1  mumbai         12

In [31]:
# for the above 2 dfs where sequence of city names is different and if we join them using just concat it will look like
df = pd.concat([temperature_df, windspeed_df], axis=1) #axis by default is 0= joins vertically, for axis as 1=horizontally
df
# here we see in result, data was added NOT on the basis of city, for this we add index in dataframes

       city  temperature    city  windspeed
0    mumbai           32   delhi        7.0
1     delhi           45  mumbai       12.0
2  banglore           30     NaN        NaN

In [35]:
temperature_df = pd.DataFrame({
    "city": ["mumbai","delhi","banglore"],
    "temperature": [32,45,30],
}, index=[0,1,2])
temperature_df

       city  temperature
0    mumbai           32
1     delhi           45
2  banglore           30

In [34]:
windspeed_df = pd.DataFrame({
    "city": ["delhi","mumbai"],
    "windspeed": [7,12],
}, index=[1,0])
windspeed_df

     city  windspeed
1   delhi          7
0  mumbai         12

In [40]:
df = pd.concat([temperature_df, windspeed_df], axis=1)
df
#here each city is front of the same city

       city  temperature    city  windspeed
0    mumbai           32  mumbai       12.0
1     delhi           45   delhi        7.0
2  banglore           30     NaN        NaN

In [52]:
# JOINIG DATAFRAME with a SERIES
s = pd.Series(['humid','dry','rain'], name='event')
s

0    humid
1      dry
2     rain
Name: event, dtype: object

In [55]:
df = pd.concat([temperature_df, s], axis=1)
df

       city  temperature  event
0    mumbai           32  humid
1     delhi           45    dry
2  banglore           30   rain